Catalogs/ШаблоныПоясненийДляФНС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ШаблоныПоясненийДляФНС</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонХранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяМакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШаблоныПоясненийДляФНС/Forms/РедактированиеШаблона/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Объект.ИмяМакета) Тогда 
		Элементы.ВосстановитьТиповойШаблон.Видимость = Истина;
	Иначе 
		Элементы.ВосстановитьТиповойШаблон.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		СсылкаНаШаблон = Объект.Ссылка;
	ИначеЕсли Параметры.Свойство("ЗначениеКопирования")
			И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда 
		СсылкаНаШаблон = Параметры.ЗначениеКопирования;
	КонецЕсли;
	
	ТекстЗагружен = Справочники.ШаблоныПоясненийДляФНС.УстановитьТекстВФорматированныйДокумент(
		СсылкаНаШаблон, 
		Шаблон,
		"ШаблонХранилище");

	Если НЕ ТекстЗагружен И ЗначениеЗаполнено(Объект.ИмяМакета) Тогда
		
		Макет = Справочники.ШаблоныПоясненийДляФНС.ПолучитьМакет(Объект.ИмяМакета);
		Вложения = Новый Структура();
		Шаблон.УстановитьHTML(Макет.ПолучитьТекст(), Вложения);
		
	КонецЕсли;
	
	Оранжевый = ЦветаСтиля.ЦветАктивности;
	
	ТипИТемаИнтерфейса(); 
    
	ЦветПоУмолчанию = Новый Цвет;
	ЦветТекстаТемнойТемы = Новый Цвет(255, 255, 255);
	УстановитьЦветТекста(Шаблон, ЦветПоУмолчанию, ЦветТекстаТемнойТемы, ЭтоИнтерфейс85, ЭтоТемнаяТема); 
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
    ЦветПоиска = Новый Цвет(0, 0, 0);
	УстановитьЦветТекста(Шаблон, ЦветПоиска, ЦветПоУмолчанию, ЭтоИнтерфейс85, ЭтоТемнаяТема); 

	Справочники.ШаблоныПоясненийДляФНС.СохранитьФорматированныйДокумент(
		ТекущийОбъект, 
		Шаблон, 
		"ШаблонХранилище");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ШаблонПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НаименованиеОрганизации(Команда)
	ВставитьПараметр("{НаименованиеОрганизации}");
КонецПроцедуры

&НаКлиенте
Процедура Сегодня(Команда)
	ВставитьПараметр("{ДатаСегодня}");
КонецПроцедуры

&НаКлиенте
Процедура Руководитель(Команда)
	ВставитьПараметр("{Руководитель}");
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьРуководителя(Команда)
	ВставитьПараметр("{ДолжностьРуководителя}");
КонецПроцедуры

&НаКлиенте
Процедура ИНН(Команда)
	ВставитьПараметр("{ИНН}");
КонецПроцедуры

&НаКлиенте
Процедура КПП(Команда)
	ВставитьПараметр("{КПП}");
КонецПроцедуры

&НаКлиенте
Процедура ОГРН(Команда)
	ВставитьПараметр("{ОГРН}");
КонецПроцедуры

&НаКлиенте
Процедура Адрес(Команда)
	ВставитьПараметр("{Адрес}");
КонецПроцедуры

&НаКлиенте
Процедура Телефон(Команда)
	ВставитьПараметр("{Телефон}");
КонецПроцедуры

&НаКлиенте
Процедура Требование(Команда)
	ВставитьПараметр("{Требование}");
КонецПроцедуры

&НаКлиенте
Процедура ИФНС(Команда)
	ВставитьПараметр("{ИФНС}");
КонецПроцедуры

&НаКлиенте
Процедура Исполнитель(Команда)
	ВставитьПараметр("{Исполнитель}");
КонецПроцедуры

&НаКлиенте
Процедура ВернутьШаблон(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ВосстановитьТиповойШаблонЗавершение", ЭтотОбъект);

	ТекстВопроса = НСтр("ru = 'Заменить текущий шаблон договора на типовой?'");
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВставитьПараметр(Значение)
	
	Структура = ТребованияФНСКлиентСервер.ШаблонЗначенияШаблона(Значение);
	
	ТребованияФНСКлиент.ВставитьПараметр(
	ЭтотОбъект,
	"Шаблон",
	Структура);
	
	УстановитьЦветТекста(Шаблон, ЦветПоУмолчанию, ЦветТекстаТемнойТемы, ЭтоИнтерфейс85, ЭтоТемнаяТема); 
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьТиповойШаблонНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.ИмяМакета) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Макет = Справочники.ШаблоныПоясненийДляФНС.ПолучитьМакет(Объект.ИмяМакета);
	Исключение
		ТекстОшибки = НСтр("ru = 'Не удалось восстановить стандартный шаблон %1, возможно он устарел. Для создания шаблона на основе стандартного воспользуйтесь пунктом меню «Создать»-«На основе стандартного шаблона» в списке шаблонов.'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, Объект.ИмяМакета);
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат;
	КонецПопытки; 
	
	ТекстHTML = Макет.ПолучитьТекст();
	Вложения = Новый Структура;
	Шаблон.УстановитьHTML(ТекстHTML, Вложения);
	
	УстановитьЦветТекста(Шаблон, ЦветПоУмолчанию, ЦветТекстаТемнойТемы, ЭтоИнтерфейс85, ЭтоТемнаяТема);  
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьТиповойШаблонЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ВосстановитьТиповойШаблонНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЦветТекста(Шаблон, ТекущийЦветТекста, ЦветЗамены, ЭтоИнтерфейс85, ЭтоТемнаяТема)
	
	Если Не ЭтоИнтерфейс85 Тогда
		Возврат;	
	КонецЕсли;
	
	Если Не ЭтоТемнаяТема Тогда
		Возврат;
	КонецЕсли;  
	
	ЧерныйЦвет = Новый Цвет(0, 0, 0);
	ЦветПоУмолчанию = Новый Цвет;
	
	Для каждого ТекущаяСтрока Из Шаблон.Элементы Цикл
		
		Для каждого ТекущийЭлемент Из ТекущаяСтрока.Элементы Цикл
			
			Если Не ТипЗнч(ТекущийЭлемент) = Тип("ТекстФорматированногоДокумента") Тогда
				Продолжить;
			КонецЕсли;
			
			ЦветТекста = ТекущийЭлемент.ЦветТекста;
			ЦветФона = ТекущийЭлемент.ЦветФона; 
			
			Если ЭтоСветлыйЦвет(ЦветФона) И ЦветТекста = ТекущийЦветТекста Тогда
				ТекущийЭлемент.ЦветТекста = ЦветЗамены;
			КонецЕсли;   
			
			Если (ЦветТекста = ЧерныйЦвет Или ЦветТекста = ЦветПоУмолчанию)
				И (ЦветФона = ЧерныйЦвет Или ЦветФона = ЦветПоУмолчанию) Тогда
				ТекущийЭлемент.ЦветТекста = ЦветПоУмолчанию;
				ТекущийЭлемент.ЦветФона = ЦветПоУмолчанию;
				
			КонецЕсли;
			
		КонецЦикла; 
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоСветлыйЦвет(ТекущийЦвет)
	
	СветлыйЦвет = Ложь; 
	
	ЯркостьЦвета = 0.299 * ТекущийЦвет.Красный + 0.587 * ТекущийЦвет.Зеленый + 0.114 * ТекущийЦвет.Синий;
	
	Если ЯркостьЦвета > 127.5 Тогда
		СветлыйЦвет = Истина;
	КонецЕсли;
	
	Возврат СветлыйЦвет;
	
КонецФункции

&НаСервере
Процедура ТипИТемаИнтерфейса()
	
	ЭтоИнтерфейс85 = ДокументооборотСКОКлиентСервер.ЭтоИнтерфейс85();
	НастройкиКлиентскогоПриложения = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения", , );
	ЭтоТемнаяТема = НастройкиКлиентскогоПриложения.ТемаКлиентскогоПриложения = ТемаКлиентскогоПриложения.Темная;  
	
КонецПроцедуры

#КонецОбласти
